Autodesk.Revit.DB.PartMaker.SetSourceElementIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Set the source elements for the PartMaker.
sourceElementIds:
Elements to be the sources for this PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be a source for this PartMaker
Elements should be Parts that have no PartMaker yet
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013